-- -----------------------------------------------------
-- Добавление пользователей
-- -----------------------------------------------------

INSERT user(creation_time, email, login, password, avatar)
VALUES
       ('2019-11-20 21:15:55', 'lara@yandex.ru', 'Лариса', ' ', 'img/userpic-larisa-small.jpg', 0, 2),
       ('2020-02-08 12:35:00', 'vlad@mail.ru', 'Владик', ' ', 'img/userpic.jpg'), 0, 2
       ('2020-03-19 11:25:05', 'vick@gmail.com', 'Виктор', ' ', 'img/userpic-mark.jpg', 1, 1);

-- -----------------------------------------------------
-- Создание списка типов контента для поста
-- -----------------------------------------------------

INSERT content_type(name, class)
VALUES
       ('Текст', 'post-text'),
       ('Цитата', 'post-quote'),
       ('Фото', 'post-photo'),
       ('Видео', 'post-video'),
       ('Ссылка', 'post-link');

-- -----------------------------------------------------
-- Создание списка постов
-- -----------------------------------------------------

INSERT post(creation_time, heading, text, author_quote, picture, video, link, views, user_id, content_type_id)
VALUES
       ('2019-12-20 01:10:00', 'Цитата', 'Мы в жизни любим только раз, а после ищем лишь похожих', 'С.А.Есенин', '', '', '', 1, 1, 2, 1, 0, 0),
       ('2020-02-09 10:53:10', 'Игра престолов',
        'Не могу дождаться начала финального сезона своего любимого сериала! Не могу дождаться начала финального сезона своего любимого сериала! Не могу дождаться начала финального сезона своего любимого сериала! Не могу дождаться начала финального сезона своего любимого сериала!Не могу дождаться начала финального сезона своего любимого сериала!',
        '', '', '', '', 0, 2, 1, 0, 0, 0),
       ('2020-03-21 19:55:03', 'Наконец, обработал фотки!', '', '', 'img/rock-medium.jpg', '', '', 2, 3, 3, 2, 1, 0),
       ('2020-04-04 15:39:33', 'Моя мечта', '', '', 'img/coast-medium.jpg', '', '', 2, 1, 3, 0, 2, 0),
       ('2020-04-19 05:59:59', 'Лучшие курсы', '', '', '', '', 'www.htmlacademy.ru', 3, 2, 5, 0, 0, 0);

-- -----------------------------------------------------
-- Создание списка комментариев
-- -----------------------------------------------------

INSERT comment (creation_time, text, user_id, post_id)
VALUES
       ('2020-04-04 16:40:33', 'Моя тоже! :-)', 2, 4),
	   ('2020-04-05 10:10:11', 'Это где?', 3, 4),
	   ('2020-04-21 20:22:44', 'Похоже на Байкал.', 2, 3);

-- -----------------------------------------------------
-- Получить список постов с сортировкой по популярности и вместе с именами авторов и типом контента
-- -----------------------------------------------------

SELECT p.id, p.heading, p.text, p.views, u.login, c.name
FROM   post AS p

       JOIN user AS u
       ON u.id = p.user_id

       JOIN content_type AS c
       ON c.id = p.content_type_id

ORDER BY p.views DESC;

-- -----------------------------------------------------
-- Получить список постов для конкретного пользователя
-- -----------------------------------------------------
SELECT post.id, post.heading, user.login
FROM   post
       JOIN user
       ON user.id = post.user_id
WHERE
       user.id = 1;

-- -----------------------------------------------------
-- Получить список комментариев для одного поста, в комментариях должен быть логин пользователя
-- -----------------------------------------------------

SELECT comment.id, comment.text, user.login
FROM   comment
       JOIN user
       ON user.id = comment.user_id

	   JOIN post
       ON post.id = comment.post_id
WHERE
       post.id = 4;

-- -----------------------------------------------------
-- Добавление лайков к постам
-- -----------------------------------------------------

INSERT `like` (post_id, user_id)
VALUES
       (1, 2),
       (3, 1),
       (3, 2);

-- -----------------------------------------------------
-- подписаться на пользователя
-- -----------------------------------------------------

INSERT subscription (creator_user_id, subscriber_user_id)
VALUES (3, 1);
